Autodesk.Revit.DB.Architecture.StairsTextOrientation
The options to be used when orienting text annotations relative to stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsTextOrientation.Vertical
Indicator text will be displayed vertically.

Autodesk.Revit.DB.Architecture.StairsTextOrientation.Horizontal
Indicator text will be displayed horizontally.